Revit 2027 API
BuiltInFailures.GeneralFailures.GenericNonFatalError Property
 A serious error has occurred. It is strongly recommended that you use Save As to save your work in a new file before continuing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericNonFatalError { get; }
Public Shared ReadOnly Property GenericNonFatalError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericNonFatalError {
	FailureDefinitionId^ get ();
}
static member GenericNonFatalError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace